# -*- coding: utf-8 -*-

import pyautogui
from selenium import webdriver

driver = webdriver.Chrome()
#寿司打のページへ
driver.get("http://neutral.x0.com/home/sushida/play1.html")

#指定の場所でクリック
pyautogui.moveTo(600, 550)
pyautogui.click()

#指定の場所でクリック
pyautogui.moveTo(400, 210)
#時間を稼ぐ
for i in range(110000):
  print(i)
pyautogui.click()

pyautogui.moveTo(600, 480)
#時間を稼ぐ
for i in range(1100000):
  print(i)
pyautogui.moveTo(600, 490)
pyautogui.click()

#時間を稼ぐ
for i in range(110000):
  print(i)
pyautogui.moveTo(600, 550)
pyautogui.click()

pyautogui.press('space')

for i in range(4):
  pyautogui.press(['a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-','a','b','c','a','d','e','i','f','g','u','h','i','j','e','k','l','m','n','n','o','p','r','o','s','t','a','u','w','i','y','u','z',',','e','-'])
  # pyautogui.press('q')
  # pyautogui.press('a')
  # pyautogui.press('z')
  # pyautogui.press('w')
  # pyautogui.press('s')
  # pyautogui.press('x')
  # pyautogui.press('e')
  # pyautogui.press('d')
  # pyautogui.press('c')
  # pyautogui.press('r')
  # pyautogui.press('f')
  # pyautogui.press('v')
  # pyautogui.press('t')
  # pyautogui.press('g')
  # pyautogui.press('b')
  # pyautogui.press('y')
  # pyautogui.press('h')
  # pyautogui.press('n')
  # pyautogui.press('u')
  # pyautogui.press('j')
  # pyautogui.press('m')
  # pyautogui.press('i')
  # pyautogui.press('k')
  # pyautogui.press(',')
  # pyautogui.press('o')
  # pyautogui.press('l')
  # pyautogui.press('-')
  # pyautogui.press('p')